package com.example.DJstlia;

public class Point_Flag {
	
	double x[] = new double[20];    //表示经度
	double y[] = new double[20];    //表示纬度
	
	public double[] getX() {
		return x;
	}

	public void setX(double[] x) {
		this.x = x;
	}

	public void setY(double[] y) {
		this.y = y;
	}

	public double[] getY() {
		return y;
	}

      //将节点的经纬度信息记录    主要有两个作用
	  //1、在算法之前，通过经纬度计算，找出距离定位位置最近的节点作为初始点；
	  //2、算法结束后，算法给出规定好编号的节点信息，，从而查找出这些点的实际经纬度信息，返回给地图用于画折线。
	public Point_Flag(){
		x[0] = 116.746208; y[0] = 39.535811;
		x[1] = 116.746365; y[1] = 39.535091;
		x[2] = 116.746023; y[2] = 39.535028;
		x[3] = 116.74561;  y[3] = 39.534962;
		x[4] = 116.746616; y[4] = 39.534138;
		x[5] = 116.745902; y[5] = 39.533995;
		x[6] = 116.7457;   y[6] = 39.534489;
		x[7] = 116.744972; y[7] = 39.534322;
		x[8] = 116.745098; y[8] = 39.53386;
		x[9] = 116.745242; y[9] = 39.533456;
		x[10] = 116.744469; y[10] = 39.533293;
		x[11] = 116.743742; y[11] = 39.533161;
		x[12] = 116.747259; y[12] = 39.531801;
		x[13] = 116.747789; y[13] = 39.531842;
		x[14] = 116.747869; y[14] = 39.531547;
		x[15] = 116.747955; y[15] = 39.53122;
		x[16] = 116.7442; y[16] = 39.532128;		
	}

}
